outputs/ELL-2-3-30-30-10-5/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.96;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.96;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.96;
        value           uniform 0.96;
    }

    wall
    {
        type            fixedValue;
        value           uniform 0;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
